# DBSQLExecuteDelete

## Description
Deletes a resultSetInstance created with 'DBSQLExecute' or 'DBSQLExecuteDSN'

```pascal
PROCEDURE DBSQLExecuteDelete(VAR resultSetInst : LONGINT);
```

```python
def vs.DBSQLExecuteDelete():
    return resultSetInst
```

## Parameters
|Name|Type|Description|
|---|---|---|
|resultSetInst|LONGINT|   |

## Examples
[[VS:DBSQLExecuteDSN]]

## See Also
DBSQLExecuteDSN | DBSQLExecute

## Version
Availability: from Vectorworks 2011

## Category
* ODBC